# Задача 4. Журавлики. Вариант 1.
# n = int(input("Введите число: "))
# while n % 6 != 0:
#     n = int(input("Ошибка! Введите правильное число: "))
# p = n//6
# k = p*4
# print("Петя", p, "Катя", k, "Серёжа", p)
# ----------------------------------------------
# Задача 4. Журавлики. Вариант 2.
n = int(input("Введите число журавликов: ")) // 3
print("Петя", n // 2, "Катя", n * 2, "Серёжа", n // 2)
# ----------------------------------------------
